# Watershed Properties Data Extraction with SQL

Watershed's intern put together a couple of sources of information that will be useful for your project. These three types of information are contained in the capstone database:
1. the current monthly rent Watershed charges for all of their client’s 244 properties, as well as the property type and geographic location of those properties. 
2. some general information about examples of short-term rental properties.  This information can be used to get a sense of what kind of nightly rental price Watershed’s client’s properties *could* be listed for, if they were converted to short-term rentals.
3. records about when those short-term rental properties were rented out, so that you can calculate their occupancy rates.

Your job is to determine how the database is organized so that you can retrieve all of the available information about Watershed’s client’s 244 properties, as well as the corresponding short-term rental information for comparable properties in the same location and of the same type.
1. Start by determining what tables the database contains, and what fields are included in each table.  
2. Then, we recommend that you make at least a rough relational schema of how the database is organized, so that you know what fields you can use to join tables. 
3. Next, make a list of the columns of data you want to retrieve in your final output.  
4. Finally, write your query to retrieve the desired data from the database.

### Load and connect to the database

In [1]:
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/capstone 
%sql USE capstone

0 rows affected.

[]

### Queries

#### Explore the database in order to build a relational schema

In [2]:
%sql SHOW tables

6 rows affected.

[('location',),
 ('property_type',),
 ('st_property_info',),
 ('st_rental_dates',),
 ('st_rental_prices',),
 ('watershed_property_info',)]

In [3]:
%sql SHOW columns FROM location

4 rows affected.

[('location_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('city', 'varchar(255)', 'YES', '', None, ''),
 ('state', 'varchar(255)', 'YES', '', None, ''),
 ('zipcode', 'int(5)', 'YES', '', None, '')]

In [4]:
%sql SHOW columns FROM property_type

5 rows affected.

[('property_type_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('apt_house', 'varchar(255)', 'YES', '', None, ''),
 ('num_bedrooms', 'varchar(255)', 'YES', '', None, ''),
 ('kitchen', 'varchar(255)', 'YES', '', None, ''),
 ('shared', 'varchar(255)', 'YES', '', None, '')]

In [5]:
%sql SHOW columns FROM st_property_info

3 rows affected.

[('st_property_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('location', 'varchar(255)', 'YES', '', None, ''),
 ('property_type', 'varchar(255)', 'YES', '', None, '')]

In [6]:
%sql SHOW columns FROM st_rental_dates

2 rows affected.

[('rental_date', 'date', 'NO', 'PRI', None, ''),
 ('st_property', 'varchar(255)', 'NO', 'PRI', None, '')]

In [7]:
%sql SHOW columns FROM st_rental_prices

5 rows affected.

[('location', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('property_type', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('percentile_10th_price', 'int(11)', 'YES', '', None, ''),
 ('percentile_90th_price', 'int(11)', 'YES', '', None, ''),
 ('sample_nightly_rent_price', 'int(11)', 'YES', '', None, '')]

In [8]:
%sql SHOW columns FROM watershed_property_info

4 rows affected.

[('ws_property_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('location', 'varchar(255)', 'YES', '', None, ''),
 ('property_type', 'varchar(255)', 'YES', '', None, ''),
 ('current_monthly_rent', 'int(11)', 'NO', '', None, '')]

#### What are the properties in the location table?

In [25]:
%%sql
SELECT location_id
FROM location
limit 20

20 rows affected.

[('L1',),
 ('L10',),
 ('L100',),
 ('L1000',),
 ('L10000',),
 ('L10001',),
 ('L10002',),
 ('L10003',),
 ('L10004',),
 ('L10005',),
 ('L10006',),
 ('L10007',),
 ('L10008',),
 ('L10009',),
 ('L1001',),
 ('L10010',),
 ('L10011',),
 ('L10012',),
 ('L10013',),
 ('L10014',)]

#### What are the properties in the Watershed table?

In [26]:
%%sql
SELECT ws_property_id, location, property_type, current_monthly_rent
FROM watershed_property_info
limit 20

20 rows affected.

[('W1', 'L9531', 'R6', 1060),
 ('W10', 'L9533', 'R6', 1200),
 ('W100', 'L1944', 'R2', 3300),
 ('W101', 'L15257', 'R2', 1400),
 ('W102', 'L15257', 'R6', 2000),
 ('W103', 'L15257', 'R10', 1600),
 ('W104', 'L15257', 'R14', 2800),
 ('W105', 'L15260', 'R2', 1100),
 ('W106', 'L15260', 'R6', 1900),
 ('W107', 'L15260', 'R10', 1800),
 ('W108', 'L15260', 'R14', 3200),
 ('W109', 'L15264', 'R2', 1000),
 ('W11', 'L9533', 'R10', 1000),
 ('W110', 'L15264', 'R6', 1300),
 ('W111', 'L15264', 'R10', 1200),
 ('W112', 'L15264', 'R14', 1600),
 ('W113', 'L15278', 'R2', 800),
 ('W114', 'L15278', 'R6', 1200),
 ('W115', 'L15278', 'R10', 900),
 ('W116', 'L15278', 'R14', 1100)]

#### What are the properties in the short-term rental table?

In [27]:
%%sql
SELECT st_property_id, location, property_type
FROM st_property_info
limit 20

20 rows affected.

[('ST1', 'L9531', 'R6'),
 ('ST10', 'L9533', 'R6'),
 ('ST100', 'L1944', 'R2'),
 ('ST1000', 'L5957', 'R1'),
 ('ST101', 'L15257', 'R2'),
 ('ST102', 'L15257', 'R6'),
 ('ST103', 'L15257', 'R10'),
 ('ST104', 'L15257', 'R14'),
 ('ST105', 'L15260', 'R2'),
 ('ST106', 'L15260', 'R6'),
 ('ST107', 'L15260', 'R10'),
 ('ST108', 'L15260', 'R14'),
 ('ST109', 'L15264', 'R2'),
 ('ST11', 'L9533', 'R10'),
 ('ST110', 'L15264', 'R6'),
 ('ST111', 'L15264', 'R10'),
 ('ST112', 'L15264', 'R14'),
 ('ST113', 'L15278', 'R2'),
 ('ST114', 'L15278', 'R6'),
 ('ST115', 'L15278', 'R10')]

#### What information is available for Watershed's 244 properties?

In [28]:
%%sql
SELECT w.ws_property_id, w.current_monthly_rent, w.property_type, p.apt_house, p.num_bedrooms, p.kitchen, p.shared, w.location,
l.city, l.state, l.zipcode
FROM watershed_property_info w, property_type p, location l
WHERE w.property_type=p.property_type_id AND w.location=l.location_id
limit 20;

20 rows affected.

[('W1', 1060, 'R6', 'apartment', '2', 'Y', 'N', 'L9531', 'Chapel Hill', 'NC', 27514),
 ('W10', 1200, 'R6', 'apartment', '2', 'Y', 'N', 'L9533', 'Chapel Hill', 'NC', 27517),
 ('W100', 3300, 'R2', 'apartment', '1', 'Y', 'N', 'L1944', 'San Francisco', 'CA', 94129),
 ('W101', 1400, 'R2', 'apartment', '1', 'Y', 'N', 'L15257', 'Austin', 'TX', 78702),
 ('W102', 2000, 'R6', 'apartment', '2', 'Y', 'N', 'L15257', 'Austin', 'TX', 78702),
 ('W103', 1600, 'R10', 'house', '1', 'Y', 'N', 'L15257', 'Austin', 'TX', 78702),
 ('W104', 2800, 'R14', 'house', '2', 'Y', 'N', 'L15257', 'Austin', 'TX', 78702),
 ('W105', 1100, 'R2', 'apartment', '1', 'Y', 'N', 'L15260', 'Austin', 'TX', 78705),
 ('W106', 1900, 'R6', 'apartment', '2', 'Y', 'N', 'L15260', 'Austin', 'TX', 78705),
 ('W107', 1800, 'R10', 'house', '1', 'Y', 'N', 'L15260', 'Austin', 'TX', 78705),
 ('W108', 3200, 'R14', 'house', '2', 'Y', 'N', 'L15260', 'Austin', 'TX', 78705),
 ('W109', 1000, 'R2', 'apartment', '1', 'Y', 'N', 'L15264', 'Austin', 'TX', 78723),
 ('W11', 1000, 'R10', 'house', '1', 'Y', 'N', 'L9533', 'Chapel Hill', 'NC', 27517),
 ('W110', 1300, 'R6', 'apartment', '2', 'Y', 'N', 'L15264', 'Austin', 'TX', 78723),
 ('W111', 1200, 'R10', 'house', '1', 'Y', 'N', 'L15264', 'Austin', 'TX', 78723),
 ('W112', 1600, 'R14', 'house', '2', 'Y', 'N', 'L15264', 'Austin', 'TX', 78723),
 ('W113', 800, 'R2', 'apartment', '1', 'Y', 'N', 'L15278', 'Austin', 'TX', 78744),
 ('W114', 1200, 'R6', 'apartment', '2', 'Y', 'N', 'L15278', 'Austin', 'TX', 78744),
 ('W115', 900, 'R10', 'house', '1', 'Y', 'N', 'L15278', 'Austin', 'TX', 78744),
 ('W116', 1100, 'R14', 'house', '2', 'Y', 'N', 'L15278', 'Austin', 'TX', 78744)]

#### These properties are located in which distinct zip codes?

In [16]:
%%sql
SELECT DISTINCT l.zipcode
FROM watershed_property_info w, location l
WHERE w.location=l.location_id
GROUP BY l.zipcode;

62 rows affected.

[(10002,),
 (10004,),
 (10014,),
 (10019,),
 (10023,),
 (11101,),
 (11211,),
 (23060,),
 (23113,),
 (23220,),
 (23234,),
 (27514,),
 (27516,),
 (27517,),
 (27707,),
 (29438,),
 (29470,),
 (29487,),
 (33122,),
 (33137,),
 (33146,),
 (33149,),
 (33178,),
 (43201,),
 (43212,),
 (43222,),
 (60607,),
 (60611,),
 (60616,),
 (60642,),
 (60654,),
 (68046,),
 (68106,),
 (68110,),
 (68114,),
 (72712,),
 (72719,),
 (78702,),
 (78705,),
 (78723,),
 (78744,),
 (78746,),
 (80204,),
 (80209,),
 (80218,),
 (80220,),
 (80249,),
 (91910,),
 (91950,),
 (92102,),
 (92118,),
 (92154,),
 (94025,),
 (94103,),
 (94110,),
 (94112,),
 (94118,),
 (94129,),
 (94301,),
 (94303,),
 (94305,),
 (94306,)]

#### Calculate occupancy rates for the short-term property example data
##### Divide the number of days in 2015 that the property had been rented by the number of total days in 2015

In [17]:
%%sql
SELECT st_property, COUNT(rental_date)/365 AS Occupancy
FROM st_rental_dates
WHERE EXTRACT(year FROM rental_date)=2015
GROUP BY st_property
LIMIT 10;

10 rows affected.

[('ST1', Decimal('0.1616')),
 ('ST10', Decimal('0.3479')),
 ('ST100', Decimal('0.3973')),
 ('ST1000', Decimal('0.9808')),
 ('ST101', Decimal('0.3644')),
 ('ST102', Decimal('0.4110')),
 ('ST103', Decimal('0.4110')),
 ('ST104', Decimal('0.5260')),
 ('ST105', Decimal('0.4329')),
 ('ST106', Decimal('0.6959'))]

#### These occupancy rates correspond to which locations and property types?

In [18]:
%%sql
SELECT sd.st_property, COUNT(sd.rental_date)/365 AS Occupancy, si.location, si.property_type
FROM st_property_info si JOIN st_rental_dates sd
  ON si.st_property_id=sd.st_property
WHERE EXTRACT(year FROM rental_date)=2015
GROUP BY st_property
LIMIT 10;

10 rows affected.

[('ST1', Decimal('0.1616'), 'L9531', 'R6'),
 ('ST10', Decimal('0.3479'), 'L9533', 'R6'),
 ('ST100', Decimal('0.3973'), 'L1944', 'R2'),
 ('ST1000', Decimal('0.9808'), 'L5957', 'R1'),
 ('ST101', Decimal('0.3644'), 'L15257', 'R2'),
 ('ST102', Decimal('0.4110'), 'L15257', 'R6'),
 ('ST103', Decimal('0.4110'), 'L15257', 'R10'),
 ('ST104', Decimal('0.5260'), 'L15257', 'R14'),
 ('ST105', Decimal('0.4329'), 'L15260', 'R2'),
 ('ST106', Decimal('0.6959'), 'L15260', 'R6')]

#### What are the sample nightly rent prices for these properties?

In [19]:
%%sql
SELECT i.st_property_id, p.sample_nightly_rent_price, i.location, i.property_type
FROM st_property_info i JOIN st_rental_prices p
  ON i.location=p.location 
GROUP BY st_property_id
LIMIT 10;

10 rows affected.

[('ST1', 104, 'L9531', 'R6'),
 ('ST10', 50, 'L9533', 'R6'),
 ('ST100', 139, 'L1944', 'R2'),
 ('ST101', 420, 'L15257', 'R2'),
 ('ST102', 420, 'L15257', 'R6'),
 ('ST103', 420, 'L15257', 'R10'),
 ('ST104', 420, 'L15257', 'R14'),
 ('ST105', 249, 'L15260', 'R2'),
 ('ST106', 249, 'L15260', 'R6'),
 ('ST107', 249, 'L15260', 'R10')]

#### What is the nightly rent price for short-term rental examples corresponding to Watershed's properties of the same location and property type?

In [20]:
%%sql
SELECT w.ws_property_id, w.location, w.property_type, sp.percentile_10th_price, sp.percentile_90th_price, sp.sample_nightly_rent_price
FROM watershed_property_info w JOIN st_rental_prices sp
  ON w.location=sp.location AND w.property_type=sp.property_type
GROUP BY w.ws_property_id
LIMIT 10;

10 rows affected.

[('W1', 'L9531', 'R6', 114, 153, 148),
 ('W10', 'L9533', 'R6', 111, 149, 133),
 ('W100', 'L1944', 'R2', 108, 610, 372),
 ('W101', 'L15257', 'R2', 178, 533, 302),
 ('W102', 'L15257', 'R6', 221, 617, 429),
 ('W103', 'L15257', 'R10', 202, 646, 380),
 ('W104', 'L15257', 'R14', 197, 639, 374),
 ('W105', 'L15260', 'R2', 114, 477, 386),
 ('W106', 'L15260', 'R6', 80, 583, 212),
 ('W107', 'L15260', 'R10', 239, 1431, 969)]

#### Join the Watershed Property IDs with corresponding sample occupancy rates

In [21]:
%%sql
SELECT w.ws_property_id, w.location, w.property_type, Sample.Occupancy
FROM watershed_property_info w LEFT JOIN (SELECT si.location, si.property_type, sd.st_property, COUNT(sd.rental_date)/365
                                          AS Occupancy
                                          FROM st_property_info si JOIN st_rental_dates sd
                                            ON si.st_property_id=sd.st_property
                                          WHERE EXTRACT(year FROM rental_date)=2015
                                          GROUP BY st_property) AS Sample
  ON w.location=Sample.location AND w.property_type=Sample.property_type
GROUP BY w.ws_property_id
LIMIT 10;

10 rows affected.

[('W1', 'L9531', 'R6', Decimal('0.1616')),
 ('W10', 'L9533', 'R6', Decimal('0.3479')),
 ('W100', 'L1944', 'R2', Decimal('0.3973')),
 ('W101', 'L15257', 'R2', Decimal('0.3644')),
 ('W102', 'L15257', 'R6', Decimal('0.4110')),
 ('W103', 'L15257', 'R10', Decimal('0.4110')),
 ('W104', 'L15257', 'R14', Decimal('0.5260')),
 ('W105', 'L15260', 'R2', Decimal('0.4329')),
 ('W106', 'L15260', 'R6', Decimal('0.6959')),
 ('W107', 'L15260', 'R10', Decimal('0.1096'))]

#### Join the Watershed Property IDs with corresponding sample nightly rent prices

In [22]:
%%sql
SELECT w.ws_property_id, w.location, w.property_type, l.city, l.state, l.zipcode, p.apt_house, p.num_bedrooms, p.kitchen,
p.shared, w.current_monthly_rent, sample_price.percentile_10th_price, sample_price.percentile_90th_price,
sample_price.sample_nightly_rent_price
FROM watershed_property_info w, location l, property_type p,
    (SELECT w.ws_property_id, w.location, w.property_type,
     sp.percentile_10th_price, sp.percentile_90th_price,
     sp.sample_nightly_rent_price
     FROM watershed_property_info w JOIN st_rental_prices sp
       ON w.location=sp.location AND w.property_type=sp.property_type
     GROUP BY w.ws_property_id) AS sample_price
WHERE w.property_type=p.property_type_id AND w.location=l.location_id AND w.ws_property_id=sample_price.ws_property_id
GROUP BY w.ws_property_id
LIMIT 10;

10 rows affected.

[('W1', 'L9531', 'R6', 'Chapel Hill', 'NC', 27514, 'apartment', '2', 'Y', 'N', 1060, 114, 153, 148),
 ('W10', 'L9533', 'R6', 'Chapel Hill', 'NC', 27517, 'apartment', '2', 'Y', 'N', 1200, 111, 149, 133),
 ('W100', 'L1944', 'R2', 'San Francisco', 'CA', 94129, 'apartment', '1', 'Y', 'N', 3300, 108, 610, 372),
 ('W101', 'L15257', 'R2', 'Austin', 'TX', 78702, 'apartment', '1', 'Y', 'N', 1400, 178, 533, 302),
 ('W102', 'L15257', 'R6', 'Austin', 'TX', 78702, 'apartment', '2', 'Y', 'N', 2000, 221, 617, 429),
 ('W103', 'L15257', 'R10', 'Austin', 'TX', 78702, 'house', '1', 'Y', 'N', 1600, 202, 646, 380),
 ('W104', 'L15257', 'R14', 'Austin', 'TX', 78702, 'house', '2', 'Y', 'N', 2800, 197, 639, 374),
 ('W105', 'L15260', 'R2', 'Austin', 'TX', 78705, 'apartment', '1', 'Y', 'N', 1100, 114, 477, 386),
 ('W106', 'L15260', 'R6', 'Austin', 'TX', 78705, 'apartment', '2', 'Y', 'N', 1900, 80, 583, 212),
 ('W107', 'L15260', 'R10', 'Austin', 'TX', 78705, 'house', '1', 'Y', 'N', 1800, 239, 1431, 969)]

#### Join the above two queries

In [23]:
%%sql
SELECT w.ws_property_id, w.location, w.property_type, l.city, l.state, l.zipcode, p.apt_house, p.num_bedrooms, p.kitchen,
p.shared, w.current_monthly_rent, sample_price.percentile_10th_price, sample_price.percentile_90th_price,
sample_price.sample_nightly_rent_price, sample_dates.Occupancy
FROM watershed_property_info w, location l, property_type p,
    (SELECT w.ws_property_id, w.location, w.property_type,
     sp.percentile_10th_price, sp.percentile_90th_price,
     sp.sample_nightly_rent_price
     FROM watershed_property_info w JOIN st_rental_prices sp
       ON w.location=sp.location AND w.property_type=sp.property_type
     GROUP BY w.ws_property_id) AS sample_price,
    (SELECT w.ws_property_id, w.location, w.property_type, Sample.Occupancy
     FROM watershed_property_info w LEFT JOIN (SELECT si.location, si.property_type, sd.st_property, COUNT(sd.rental_date)/365
                                               AS Occupancy
                                               FROM st_property_info si JOIN st_rental_dates sd
                                                 ON si.st_property_id=sd.st_property
                                               WHERE EXTRACT(year FROM rental_date)=2015
                                               GROUP BY st_property) AS Sample
       ON w.location=Sample.location AND w.property_type=Sample.property_type
     GROUP BY w.ws_property_id) AS sample_dates
WHERE w.property_type=p.property_type_id AND w.location=l.location_id AND w.ws_property_id=sample_price.ws_property_id AND
w.ws_property_id=sample_dates.ws_property_id
GROUP BY w.ws_property_id
LIMIT 10;

10 rows affected.

[('W1', 'L9531', 'R6', 'Chapel Hill', 'NC', 27514, 'apartment', '2', 'Y', 'N', 1060, 114, 153, 148, Decimal('0.1616')),
 ('W10', 'L9533', 'R6', 'Chapel Hill', 'NC', 27517, 'apartment', '2', 'Y', 'N', 1200, 111, 149, 133, Decimal('0.3479')),
 ('W100', 'L1944', 'R2', 'San Francisco', 'CA', 94129, 'apartment', '1', 'Y', 'N', 3300, 108, 610, 372, Decimal('0.3973')),
 ('W101', 'L15257', 'R2', 'Austin', 'TX', 78702, 'apartment', '1', 'Y', 'N', 1400, 178, 533, 302, Decimal('0.3644')),
 ('W102', 'L15257', 'R6', 'Austin', 'TX', 78702, 'apartment', '2', 'Y', 'N', 2000, 221, 617, 429, Decimal('0.4110')),
 ('W103', 'L15257', 'R10', 'Austin', 'TX', 78702, 'house', '1', 'Y', 'N', 1600, 202, 646, 380, Decimal('0.4110')),
 ('W104', 'L15257', 'R14', 'Austin', 'TX', 78702, 'house', '2', 'Y', 'N', 2800, 197, 639, 374, Decimal('0.5260')),
 ('W105', 'L15260', 'R2', 'Austin', 'TX', 78705, 'apartment', '1', 'Y', 'N', 1100, 114, 477, 386, Decimal('0.4329')),
 ('W106', 'L15260', 'R6', 'Austin', 'TX', 78705, 'apartment', '2', 'Y', 'N', 1900, 80, 583, 212, Decimal('0.6959')),
 ('W107', 'L15260', 'R10', 'Austin', 'TX', 78705, 'house', '1', 'Y', 'N', 1800, 239, 1431, 969, Decimal('0.1096'))]

### Finally, export the final query above as a .csv file for further examination in Excel and Tableau

In [24]:
Watershed_Properties_Data= %%sql \
SELECT w.ws_property_id, w.location, w.property_type, l.city, l.state, l.zipcode, p.apt_house, p.num_bedrooms, p.kitchen, \
p.shared, w.current_monthly_rent, sample_price.percentile_10th_price, sample_price.percentile_90th_price, \
sample_price.sample_nightly_rent_price, sample_dates.Occupancy \
FROM watershed_property_info w, location l, property_type p, \
    (SELECT w.ws_property_id, w.location, w.property_type, \
     sp.percentile_10th_price, sp.percentile_90th_price, \
     sp.sample_nightly_rent_price \
     FROM watershed_property_info w JOIN st_rental_prices sp \
       ON w.location=sp.location AND w.property_type=sp.property_type \
     GROUP BY w.ws_property_id) AS sample_price, \
    (SELECT w.ws_property_id, w.location, w.property_type, Sample.Occupancy \
     FROM watershed_property_info w LEFT JOIN (SELECT si.location, si.property_type, sd.st_property, COUNT(sd.rental_date)/365 \
                                               AS Occupancy \
                                               FROM st_property_info si JOIN st_rental_dates sd \
                                                 ON si.st_property_id=sd.st_property \
                                               WHERE EXTRACT(year FROM rental_date)=2015 \
                                               GROUP BY st_property) AS Sample \
       ON w.location=Sample.location AND w.property_type=Sample.property_type \
     GROUP BY w.ws_property_id) AS sample_dates \
WHERE w.property_type=p.property_type_id AND w.location=l.location_id AND w.ws_property_id=sample_price.ws_property_id AND \
w.ws_property_id=sample_dates.ws_property_id \
GROUP BY w.ws_property_id;

Watershed_Properties_Data.csv('Watershed Properties Data.csv')

244 rows affected.

CSV results at /home/jovyan/work/Capstone_course_materials/Watershed Properties Data.csv